In [2]:
import pandas as pd
df = pd.read_csv("/home/neosoft/Desktop/jupyter/data.csv") #reading the data from a csv file
df

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
1  02/02/20           34          7  sunny
2  03/03/20           28          2   snow
3  04/04/20           24          7   snow
4  05/05/20           32          4  rainy
5  01/06/20           32          2  sunny

In [3]:
#create a data using python dictionary
weather_data = {
    "day": ["01/01/2020","01/02/2020","01/03/2020"],
    "temp" : [32, 35, 28],
    "windspeed": [6,7,2],
    "event": ["rain","sunny","snow"]
}
weather_data = pd.DataFrame(weather_data)
weather_data

          day  temp  windspeed  event
0  01/01/2020    32          6   rain
1  01/02/2020    35          7  sunny
2  01/03/2020    28          2   snow

In [4]:
df.shape

(6, 4)

In [5]:
rows, col = df.shape #find rows and columns
rows

6

In [6]:
col

4

In [7]:
df.head(3) #used to print few rows
# df.head(n=3)
# For negative values of n, this function returns all the rows except for the last n rows.

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
1  02/02/20           34          7  sunny
2  03/03/20           28          2   snow

In [8]:
df.tail(1) #used to print last rows
# df.taill(n=1)
# For negative values of n, this function returns all the rows except for the first n rows.

        day  temperature  windspace  event
5  01/06/20           32          2  sunny

In [9]:
df[2:5] #selected rows using slicing

        day  temperature  windspace  event
2  03/03/20           28          2   snow
3  04/04/20           24          7   snow
4  05/05/20           32          4  rainy

In [10]:
df.columns #returns the column labels of a DataFrame

Index(['day', 'temperature', 'windspace', 'event'], dtype='object')

In [11]:
df.dtypes   # returns the datatypes of each column in a DataFrame

day            object
temperature     int64
windspace       int64
event          object
dtype: object

In [12]:
df.day #used to display our particular column

0    01/01/20
1    02/02/20
2    03/03/20
3    04/04/20
4    05/05/20
5    01/06/20
Name: day, dtype: object

In [13]:
df["event"]

0    rainy
1    sunny
2     snow
3     snow
4    rainy
5    sunny
Name: event, dtype: object

In [14]:
type(df["event"])

pandas.core.series.Series

In [15]:
df[["event", "day"]]

   event       day
0  rainy  01/01/20
1  sunny  02/02/20
2   snow  03/03/20
3   snow  04/04/20
4  rainy  05/05/20
5  sunny  01/06/20

In [16]:
df["temperature"].max() #used to maximum can also use min(), std()

34

df.describe(include=None, exclude=None)
Generates descriptive statistics.
Analyzes both numeric and object series as well as mixed data types.
include: A list of data types to include in the result.
exclude: A list of data types to omit from the result.

In [17]:
df.describe() #used to print statistics of data
# std: standard deviation

       temperature  windspace
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.669696   2.338090
min      24.000000   2.000000
25%      29.000000   2.500000
50%      32.000000   5.000000
75%      32.000000   6.750000
max      34.000000   7.000000

In [18]:
df.describe(include=[object])    
# top : most common value
# freq: most common value's frequency

             day  event
count          6      6
unique         6      3
top     01/01/20  rainy
freq           1      2

In [19]:
df.describe(include="all")
#we get NaN as a value when we can't use that datatype of value to the function. 
#For example, we can't use mean, top, freq for orderId and mean, std, min, max, 25%, 50%, 
#75% for day which is an object datatype.'

             day  temperature  windspace  event
count          6     6.000000   6.000000      6
unique         6          NaN        NaN      3
top     01/01/20          NaN        NaN  rainy
freq           1          NaN        NaN      2
mean         NaN    30.333333   4.666667    NaN
std          NaN     3.669696   2.338090    NaN
min          NaN    24.000000   2.000000    NaN
25%          NaN    29.000000   2.500000    NaN
50%          NaN    32.000000   5.000000    NaN
75%          NaN    32.000000   6.750000    NaN
max          NaN    34.000000   7.000000    NaN

In [20]:
df.describe(exclude=[object])

       temperature  windspace
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.669696   2.338090
min      24.000000   2.000000
25%      29.000000   2.500000
50%      32.000000   5.000000
75%      32.000000   6.750000
max      34.000000   7.000000

In [21]:
df.info()   # Print a concise summary of a DataFrame including the dtypes of the columns, memory usage

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspace    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [22]:
pd.Series([1, 2, 3, 4, "asdf"])  # Creating Series from a List of Data

0       1
1       2
2       3
3       4
4    asdf
dtype: object

In [23]:
df[df.temperature>=32]  #used to select conditional rows

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
1  02/02/20           34          7  sunny
4  05/05/20           32          4  rainy
5  01/06/20           32          2  sunny

In [24]:
df.temperature>=32

0     True
1     True
2    False
3    False
4     True
5     True
Name: temperature, dtype: bool

In [25]:
df[df.temperature == df.temperature.max()]

        day  temperature  windspace  event
1  02/02/20           34          7  sunny

In [26]:
df.iloc[[3, 5], [1, 3]]  # integer-location based indexing for selection by position.

   temperature  event
3           24   snow
5           32  sunny

In [27]:
df.iloc[5, 3]

'sunny'

In [28]:
df.iloc[0:5]

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
1  02/02/20           34          7  sunny
2  03/03/20           28          2   snow
3  04/04/20           24          7   snow
4  05/05/20           32          4  rainy

In [29]:
df.loc[3] # Access a group of rows and columns by label(s)
# we can give integer and/ label or name

day            04/04/20
temperature          24
windspace             7
event              snow
Name: 3, dtype: object

In [30]:
df.loc[[1,5]]

        day  temperature  windspace  event
1  02/02/20           34          7  sunny
5  01/06/20           32          2  sunny

In [31]:
df.loc[[1,5], ["day", "event"]]   # using column names

        day  event
1  02/02/20  sunny
5  01/06/20  sunny

In [32]:
df.loc[1,"windspace"]

7

In [33]:
df.loc[1:5]  # When slicing using loc the start and stop indices are included.

        day  temperature  windspace  event
1  02/02/20           34          7  sunny
2  03/03/20           28          2   snow
3  04/04/20           24          7   snow
4  05/05/20           32          4  rainy
5  01/06/20           32          2  sunny

In [34]:
df.loc[1:5, "event"]

1    sunny
2     snow
3     snow
4    rainy
5    sunny
Name: event, dtype: object

In [35]:
df.loc[1:5, "temperature":"event"]

   temperature  windspace  event
1           34          7  sunny
2           28          2   snow
3           24          7   snow
4           32          4  rainy
5           32          2  sunny

In [36]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [37]:
df.set_index("day") #used to index, it returns the new dataframe it doesnt modify the original one
# df.set_index(("day", temperature))  # if we want more than one index

          temperature  windspace  event
day
01/01/20           32          6  rainy
02/02/20           34          7  sunny
03/03/20           28          2   snow
04/04/20           24          7   snow
05/05/20           32          4  rainy
01/06/20           32          2  sunny

In [38]:
df

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
1  02/02/20           34          7  sunny
2  03/03/20           28          2   snow
3  04/04/20           24          7   snow
4  05/05/20           32          4  rainy
5  01/06/20           32          2  sunny

In [39]:
df.set_index("day", inplace=True) # it modify original one

In [40]:
df

          temperature  windspace  event
day
01/01/20           32          6  rainy
02/02/20           34          7  sunny
03/03/20           28          2   snow
04/04/20           24          7   snow
05/05/20           32          4  rainy
01/06/20           32          2  sunny

In [41]:
df.reset_index(inplace = True) #reset index
df

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
1  02/02/20           34          7  sunny
2  03/03/20           28          2   snow
3  04/04/20           24          7   snow
4  05/05/20           32          4  rainy
5  01/06/20           32          2  sunny

In [42]:
pd.set_option('display.max_rows', 4, 'display.max_columns', 2)
df

         day  ...  event
0   01/01/20  ...  rainy
1   02/02/20  ...  sunny
..       ...  ...    ...
4   05/05/20  ...  rainy
5   01/06/20  ...  sunny

[6 rows x 4 columns]

In [43]:
pd.reset_option('display')
df

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
1  02/02/20           34          7  sunny
2  03/03/20           28          2   snow
3  04/04/20           24          7   snow
4  05/05/20           32          4  rainy
5  01/06/20           32          2  sunny

In [44]:
df.sort_index()

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
1  02/02/20           34          7  sunny
2  03/03/20           28          2   snow
3  04/04/20           24          7   snow
4  05/05/20           32          4  rainy
5  01/06/20           32          2  sunny

In [45]:
df.sort_index(ascending = False)   # sort the dataframe from high to low

        day  temperature  windspace  event
5  01/06/20           32          2  sunny
4  05/05/20           32          4  rainy
3  04/04/20           24          7   snow
2  03/03/20           28          2   snow
1  02/02/20           34          7  sunny
0  01/01/20           32          6  rainy

In [46]:
import numpy as np
df1 = pd.DataFrame({
    "name":[np.nan, "Sonu", "Raj"],
    "place":[np.nan, "Bangalore", "Vijayawada"]
})
df1

   name       place
0   NaN         NaN
1  Sonu   Bangalore
2   Raj  Vijayawada

In [47]:
df1.first_valid_index()   # Returns the index of the first non-NA/null value.

1

In [48]:
import numpy as np
df2 = pd.DataFrame({
    "name":[np.nan, "Sonu", np.nan],
    "place":["Hyderabad", "Bangalore", np.nan]
})
df2

   name      place
0   NaN  Hyderabad
1  Sonu  Bangalore
2   NaN        NaN

In [49]:
df2.first_valid_index()

0

In [50]:
df['windspace']

0    6
1    7
2    2
3    7
4    4
5    2
Name: windspace, dtype: int64

In [51]:
temp_filter = df['temperature'] > 31
temp_filter

0     True
1     True
2    False
3    False
4     True
5     True
Name: temperature, dtype: bool

In [52]:
df[temp_filter]    # returns satisfied condition of temp_filter rows

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
1  02/02/20           34          7  sunny
4  05/05/20           32          4  rainy
5  01/06/20           32          2  sunny

In [53]:
df.loc[temp_filter, 'temperature']

0    32
1    34
4    32
5    32
Name: temperature, dtype: int64

In [54]:
wind_range_filter = (df['windspace'] > 3) & (df['windspace'] <= 7)
df.loc[wind_range_filter]

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
1  02/02/20           34          7  sunny
3  04/04/20           24          7   snow
4  05/05/20           32          4  rainy

In [55]:
neg_filter = (df['temperature'] > 28)
df[~neg_filter]

        day  temperature  windspace event
2  03/03/20           28          2  snow
3  04/04/20           24          7  snow

In [56]:
filter = df['event'].str.contains('rainy')
df[filter]

        day  temperature  windspace  event
0  01/01/20           32          6  rainy
4  05/05/20           32          4  rainy

In [57]:
df1 = pd.DataFrame({'A': [1, 6],

                   'B': [10, 3],

                   'C': [10, 5]})
df1

   A   B   C
0  1  10  10
1  6   3   5

In [58]:
df1.query('B == C & A < B')

   A   B   C
0  1  10  10

In [59]:
df.reset_index(inplace=True)

In [60]:
df.isna()      #if values are NaN it shows the "True" value

   index    day  temperature  windspace  event
0  False  False        False      False  False
1  False  False        False      False  False
2  False  False        False      False  False
3  False  False        False      False  False
4  False  False        False      False  False
5  False  False        False      False  False

In [61]:
df.isna().sum()   # To find the number of Nan objects within the given series

index          0
day            0
temperature    0
windspace      0
event          0
dtype: int64

In [62]:
df.fillna("MISSING")  # to fill the missing values
# value can be a single value(e.g. 0) or a dict, Series, DataFrame etc. It cannot be a list.

   index       day  temperature  windspace  event
0      0  01/01/20           32          6  rainy
1      1  02/02/20           34          7  sunny
2      2  03/03/20           28          2   snow
3      3  04/04/20           24          7   snow
4      4  05/05/20           32          4  rainy
5      5  01/06/20           32          2  sunny

#   Grouping

In [63]:
event_grp = df.groupby(['event'])     #we can give more than one value for grouping
event_grp

In [64]:
event_grp.groups

{'rainy': [0, 4], 'snow': [2, 3], 'sunny': [1, 5]}

In [65]:
event_grp.get_group('sunny')

   index       day  temperature  windspace  event
1      1  02/02/20           34          7  sunny
5      5  01/06/20           32          2  sunny

In [66]:
type(event_grp.get_group('sunny'))

pandas.core.frame.DataFrame

In [67]:
values = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
numeric_df = pd.DataFrame(values, columns=["a", "b", "c"])
numeric_df

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [68]:
grp_b = numeric_df.groupby(["b"])
grp_b.groups

{1.0: [2], 2.0: [0, 3]}

#       Aggregations

In [69]:
numeric_df.mean()

a    1.250000
b    1.666667
c    3.000000
dtype: float64

In [70]:
print('mean of temperatures:', df['temperature'].mean())
print('median of temperatures:', df['temperature'].median())
print('maximum of temperatures:', df['temperature'].max())
print('total number of temperatures:', df['temperature'].count())

mean of temperatures: 30.333333333333332
median of temperatures: 32.0
maximum of temperatures: 34
total number of temperatures: 6

In [71]:
df['event'].unique()

array(['rainy', 'sunny', 'snow'], dtype=object)

In [72]:
print('count of each event:\n', df['event'].value_counts())
# Can be used to count the number of times each value is repeated.

count of each event:
 rainy    2
sunny    2
snow     2
Name: event, dtype: int64

In [73]:
df['event'].value_counts(normalize=True)
# If normalize=True then the object returned will contain the relative frequencies of the unique values.

rainy    0.333333
sunny    0.333333
snow     0.333333
Name: event, dtype: float64

In [74]:
df.groupby('event')["windspace"].median()

event
rainy    5.0
snow     4.5
sunny    4.5
Name: windspace, dtype: float64

In [75]:
df.groupby('event').median()

       index  temperature  windspace
event
rainy    2.0         32.0        5.0
snow     2.5         26.0        4.5
sunny    3.0         33.0        4.5

In [76]:
filt = (df['event'] == "rainy")
df.loc[filt]['day'].str.contains('05')

0    False
4     True
Name: day, dtype: bool

In [77]:
df.loc[filt]['day'].str.contains('05').sum()

1

In [78]:
num_df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9]],
                  columns=['A', 'B', 'C'])
num_df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [79]:
num_df.mean()

A    4.0
B    5.0
C    6.0
dtype: float64

In [80]:
num_df.agg(['mean'])

        A    B    C
mean  4.0  5.0  6.0

In [89]:
num_df.agg(['mean', 'sum', 'min'])

         A     B     C
mean   4.0   5.0   6.0
sum   12.0  15.0  18.0
min    1.0   2.0   3.0

In [82]:
temp_grp = df.groupby('temperature')
temp_grp['windspace'].agg(['median', 'mean'])

             median  mean
temperature
24              7.0   7.0
28              2.0   2.0
32              4.0   4.0
34              7.0   7.0

In [83]:
series1 = pd.Series([3, np.nan, 4, -6, 0])
series1

0    3.0
1    NaN
2    4.0
3   -6.0
4    0.0
dtype: float64

In [84]:
series1.cumsum() # By default, it iterates over the rows and finds the sum in each column.

0    3.0
1    NaN
2    7.0
3    1.0
4    1.0
dtype: float64

In [85]:
df7 = pd.DataFrame({
    "A":[1.0, -3.0, 2.0],
    "B" : [1.0, np.nan, 0.0],
    "C" : [3.0, -2.0, -1.1]
})

df7

     A    B    C
0  1.0  1.0  3.0
1 -3.0  NaN -2.0
2  2.0  0.0 -1.1

In [86]:
df7.cumsum()

     A    B    C
0  1.0  1.0  3.0
1 -2.0  NaN  1.0
2  0.0  1.0 -0.1

In [87]:
df7.cumsum(axis = 1)  # To iterate over columns and find the sum in each row, use axis=1.

     A    B    C
0  1.0  2.0  5.0
1 -3.0  NaN -5.0
2  2.0  2.0  0.9